//Στη θεωρία των αριθμών ένας φυσικός αριθμός N λέγεται ατομικός πρώτος όταν οΝ είναι πρώτος αριθμός και 
//δεν μπορεί να γραφεί ως το άθροισμα κανενός άλλου φυσικού αριθμού και των ψηφίων αυτού του αριθμού.
//Για παράδειγμα ο αριθμός 23 δεν είναι ατομικός πρώτος, καθώς είναι μεν πρώτος αριθμός (οι μοναδικοί διαιρέτες 
//του είναι το 1 και το 23) αλλά μπορεί να γραφεί ως το άθροισμα του φυσικού αριθμού 16 και των ψηφίων του 16:23 = 16 + 1 + 6.
//Αντίστοιχα ο αριθμός 29 δεν είναι ατομικός πρώτος, καθώς είναι μεν πρώτος αριθμός αλλά μπορεί να γραφεί ως το άθροισμα 
//του φυσικού αριθμού 18 και των ψηφίων του 18: 29 = 18 + 1 + 8.
//Επίσης ο αριθμός 20 δεν είναι ατομικός πρώτος καθώς δεν είναι πρώτος αριθμός (διαιρείται π.χ. με το 2) παρότι δεν υπάρχει 
//κανένας φυσικός αριθμός και που το άθροισμα του Κ με τα ψηφία του Κ να ισούνται με 20. Π.χ. 14 + 1 + 4 = 19, 15 + 1 + 5 = 21.
//Αντίθετα ο αριθμός 31 είναι ατομικός πρώτος καθώς είναι και πρώτος αριθμός και δεν υπάρχει κανένας φυσικός αριθμός Κ που το 
//άθροισμα του Κ με τα ψηφία του Κ να ισούνται με 31. Π.χ. 24 + 2 + 4 = 30, 25 + 2 + 5 = 32
//Να γίνει πρόγραμμα το οποίο θα διαβάζει έναν ακέραιο και θα εμφανίζει:
//1. "Wrong Input" αν ο ακέραιος είναι μικρότερος του 1 2. "Yes" αν ο ακέραιος είναι ατομικός πρώτος 3. "No" αν ο ακέραιος δεν είναι ατομικός πρώτος.


#include <stdio.h>

int
atomic (int num)
{

  int res = 0, temp, remainder, sum = 0;

  for (int i = 2; i < num; i++)
    {
      sum = 0;
      temp = i;

      while (temp != 0)
	{

	  remainder = temp % 10;
	  sum = sum + remainder;
	  temp = temp / 10;


	}

      sum = sum + i;

      if (sum == num)
	{
	  res = 1;
	  break;
	}

    }

  return res;
}



int
main ()
{
  int n, at, flag = 0;
  do
    {
      printf ("Enter a positive integer: ");
      scanf ("%d", &n);
      if (n <= 1)
	printf ("WRONG INPUT\n");
    }
  while (n <= 1);

  for (int i = 2; i <= n / 2; ++i)
    {
      // condition for non-prime
      if (n % i == 0)
	{
	  flag = 1;
	  break;
	}
    }

  at = atomic (n);


  if ((flag != 1) && (at != 1))
    printf ("Yes. \n");
  else
    printf ("No. \n");

  return 0;
}



