//Nα γίνει πρόγραμμα το οποίο θα διαβάζει από το χρήστη 
//έναν φυσικό αριθμό (ακέραιος >0) No.
//Αν ο No είναι μικρότερος ή ίσος του και το πρόγραμμα 
//θα τερματίζει εμφανίζοντας το Μήνυμα "Wrong input".
//Στη διαφορετική περίπτωση το πρόγραμμα θα προσθέτει 
//τα ψηφία του Νο ώστε να προκύψει ένας νέος αριθμός N, 
//και μετά τα ψηφία του Ν, ώστε να προκύψει ακόμη ένας αριθμός 
//Ν2 και αυτή η διαδικασία θα επαναλαμβάνεται μέχρι να προκύψει 
//ένας αριθμός N, ο οποίος θα είναι μονοψήφιος.
//Έστω π.χ. ότι No=9876, τότε Ν,=30 και Ν=3, ενώ αν No=19999, 
//τότε Ν=37, No=10 και Ν3=1
//Το πρόγραμμα θα εμφανίζει σε μια σειρά (χωρισμένα με κενό) 
//τους αριθμούς k και Nk.

#include <stdio.h>

int
main ()
{
  int num, sum = 0, remainder = 0, counter = 0;
  do
    {
      printf ("Enter a natural number: ");
      scanf ("%d", &num);
      if (num <= 0)
	printf ("WRONG INPUT\n");
    }
  while (num <= 0);

  while (num > 9)
    {
      while (num != 0)
	{
	  remainder = num % 10;
	  sum = sum + remainder;
	  num = num / 10;

	}
      num = sum;
      sum = 0;
      counter++;
    }

  printf ("k:%d Nk:%d ", counter, num);

  return 0;
}
